УТ.КонтурЗакупки/src/InformationRegisters/КонтурЗакупки_УведомленияЛентаПользователя/КонтурЗакупки_УведомленияЛентаПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЗакупки_УведомленияЛентаПользователя</name>
  <resources>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПрочтения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>НазваниеПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.КонтурЗакупки/src/InformationRegisters/КонтурЗакупки_УведомленияЛентаПользователя/Forms/ФормаОтдельногоУведомления/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаголовокУведомления = Параметры.Заголовок;
	Текст = Параметры.Текст;
	Идентификатор = Параметры.Идентификатор;
	Прочитано = Параметры.Прочитано;//РегистрыСведений.КонтурЗакупки_УведомленияЛентаПользователя.Прочитано(Идентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УправлениеВидимостьюДоступностью();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрочитаноНеПрочитано(Команда)

	ПрочитаноНеПрочитаноНаСервере();
	УправлениеВидимостьюДоступностью();
	СтруктураПараметров = Новый Структура("Идентификатор, Прочитано", Идентификатор, Прочитано);
	Оповестить("КонтурУведомленияПрочитаноНеПрочитано", СтруктураПараметров);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитаноНеПрочитаноНаСервере()
	НазваниеПродукта = КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьНазваниеПродукта();

	Если РегистрыСведений.КонтурЗакупки_УведомленияЛентаПользователя.ОтметитьПрочитаннымОтложить(НазваниеПродукта,
		Идентификатор, Не Прочитано) Тогда
		Прочитано = Не Прочитано;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюДоступностью()

	Если Прочитано Тогда
		Элементы.ПрочитаноНеПрочитано.Заголовок = "Отметить непрочитанным";
		Элементы.ПрочитаноНеПрочитано.ЦветФона = WebЦвета.Белый;
	Иначе
		Элементы.ПрочитаноНеПрочитано.Заголовок = "Прочитано";
		Элементы.ПрочитаноНеПрочитано.ЦветФона = WebЦвета.Золотой;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
